#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks.module.eks_managed_node_group["general"].data.aws_caller_identity.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
aws_route53_zone.main: Refreshing state... [id=Z04081443K1L579SVWQTK]
aws_iam_role.role: Refreshing state... [id=flask-role]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0c600661d78a404c7]
module.eks.module.eks_managed_node_group["general"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["general"].data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_ami.amazon-linux-2023: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/flask-cluster/cluster]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
data.aws_iam_policy.admin_access: Reading...
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=353591665476]
aws_ecr_repository.ecr: Refreshing state... [id=flask]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=353591665476]
module.eks.module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::353591665476:user/cloud_user]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["general"].data.aws_caller_identity.current: Read complete after 0s [id=353591665476]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.eks_managed_node_group["general"].aws_iam_role.this[0]: Refreshing state... [id=general-eks-node-group-20240122112726646700000002]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=flask-cluster-cluster-20240122112726646700000001]
data.aws_caller_identity.current: Read complete after 0s [id=353591665476]
aws_iam_role.role2: Refreshing state... [id=eks-role]
data.aws_iam_policy.admin_access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.admin-role-policy-attach: Refreshing state... [id=flask-role-20240122112727456200000004]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=general-eks-node-group-20240122112726646700000002-20240122112727483100000005]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=general-eks-node-group-20240122112726646700000002-20240122112727528900000007]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=general-eks-node-group-20240122112726646700000002-20240122112727500700000006]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=flask-cluster-cluster-20240122112726646700000001-20240122112727808100000009]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=flask-cluster-cluster-20240122112726646700000001-20240122112727805600000008]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3074716909]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=67b68a39-1201-4236-a81f-0120bb7c61b0]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/flask-cluster]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::353591665476:policy/flask-cluster-cluster-ClusterEncryption2024012211274617400000000c]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=flask-cluster-cluster-20240122112726646700000001-2024012211274670110000000d]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0a5c3c15c7280a57a]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-066a9734aa404e569]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0ea153bb9bdb59e6a]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0af93fbc1b565130b]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0ae0bf0df1700958f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-053917e9447e47a3f]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-04882e20a66af77ef]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-02f4f72f652e1eade]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-009cc898a702f2757]
data.aws_ami.amazon-linux-2023: Read complete after 1s [id=ami-0e9107ed11be76fde]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0bba1c89cd9d41435]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-07c7881a9dd0d3c5d]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0697522e4c18018b5]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01e8515ce0e810c7d]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0c6c943d2d66062e4]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-06351810932ec89fa]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-09f8ef9e6af05d3f9]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0285779e4b185d29c]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0ba54a5e1120cf01a]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-028450bf90ef832e5]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0b25329cdfd5bf10a]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-053917e9447e47a3f1080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-01521df4f4d713fd3]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-06914453294d0c9b4]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3405204055]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1281435970]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1719156824]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3160808431]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1965325433]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1818162298]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-998481391]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-47805331]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1803178984]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3896412845]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-2784127782]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0188aed8818614622]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-008aad1b2595e341c]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-05fa45ae20850ef43]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-06c6e68499b011ea0]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-069f83763dc9251dc]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-09851933109390a56]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0697522e4c18018b51080289494]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-07c7881a9dd0d3c5d1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0bba1c89cd9d414351080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=flask-cluster]
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-01-22T11:38:42Z]
module.eks.data.tls_certificate.this[0]: Reading...
data.aws_eks_cluster_auth.default: Reading...
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.aws_eks_identity_provider_config.this["sts"]: Refreshing state... [id=flask-cluster:sts]
data.aws_eks_cluster_auth.default: Read complete after 0s [id=flask-cluster]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=5933588ce34e24e9fb40c3565fb0b5993639df67]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::353591665476:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/F17057BF2B7A8251915837D123247802]
module.eks.module.eks_managed_node_group["general"].aws_launch_template.this[0]: Refreshing state... [id=lt-0d1c28cd6eb655752]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Refreshing state... [id=flask-cluster:general-20240122113844549400000014]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=flask-cluster:kube-proxy]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=flask-cluster:vpc-cni]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=flask-cluster:coredns]
module.eks.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.cert_manager_irsa_role.data.aws_region.current: Reading...
module.external_dns_irsa_role.data.aws_region.current: Reading...
module.external_dns_irsa_role.data.aws_partition.current: Reading...
module.cert_manager_irsa_role.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.cert_manager_irsa_role.data.aws_partition.current: Reading...
module.external_dns_irsa_role.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.cert_manager_irsa_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.external_dns_irsa_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.external_dns_irsa_role.data.aws_caller_identity.current: Reading...
module.external_dns_irsa_role.data.aws_iam_policy_document.external_dns[0]: Reading...
module.external_dns_irsa_role.data.aws_iam_policy_document.external_dns[0]: Read complete after 0s [id=3629373516]
module.cert_manager_irsa_role.data.aws_caller_identity.current: Reading...
module.external_dns_irsa_role.aws_iam_policy.external_dns[0]: Refreshing state... [id=arn:aws:iam::353591665476:policy/AmazonEKS_External_DNS_Policy-20240122114519942900000019]
module.cert_manager_irsa_role.data.aws_iam_policy_document.cert_manager[0]: Reading...
module.cert_manager_irsa_role.data.aws_iam_policy_document.cert_manager[0]: Read complete after 0s [id=2054377048]
module.external_dns_irsa_role.data.aws_caller_identity.current: Read complete after 0s [id=353591665476]
module.cert_manager_irsa_role.aws_iam_policy.cert_manager[0]: Refreshing state... [id=arn:aws:iam::353591665476:policy/AmazonEKS_Cert_Manager_Policy-2024012211451994620000001a]
module.external_dns_irsa_role.data.aws_iam_policy_document.this[0]: Reading...
module.external_dns_irsa_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2984066799]
module.external_dns_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=external-dns]
module.cert_manager_irsa_role.data.aws_caller_identity.current: Read complete after 0s [id=353591665476]
module.cert_manager_irsa_role.data.aws_iam_policy_document.this[0]: Reading...
module.cert_manager_irsa_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2341259877]
module.cert_manager_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=cert-manager]
module.external_dns_irsa_role.aws_iam_role_policy_attachment.external_dns[0]: Refreshing state... [id=external-dns-2024012211452092040000001c]
module.cert_manager_irsa_role.aws_iam_role_policy_attachment.cert_manager[0]: Refreshing state... [id=cert-manager-2024012211452090050000001b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.cert-manager will be created
  + resource "helm_release" "cert-manager" {
      + atomic                     = true
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.13.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "cert-manager"
        }
    }

  # helm_release.external_dns will be created
  + resource "helm_release" "external_dns" {
      + atomic                     = false
      + chart                      = "external-dns"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-dns"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "6.13.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "domainFilters"
          + value = "{ev4o.com}"
        }
      + set {
          + name  = "provider"
          + value = "aws"
        }
      + set {
          + name  = "registry"
          + value = "txt"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "external-dns"
        }
      + set {
          + name  = "sources"
          + value = "{ingress}"
        }
      + set {
          + name  = "txtOwnerId"
          + value = "Owner"
        }
      + set {
          + name  = "txtPrefix"
          + value = "prefix"
        }
    }

  # helm_release.nginx-ingress will be created
  + resource "helm_release" "nginx-ingress" {
      + atomic                     = true
      + chart                      = "nginx-ingress-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "nginx-ingress-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "9.7.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "publishService.enabled"
          + value = "true"
        }
      + set {
          + name  = "service.type"
          + value = "LoadBalancer"
        }
    }

  # kubernetes_service_account.cert-account will be created
  + resource "kubernetes_service_account" "cert-account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "eks.amazonaws.com/role-arn"               = "arn:aws:iam::353591665476:role/cert-manager"
              + "eks.amazonaws.com/sts-regional-endpoints" = "true"
            }
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/component" = "cert-manager"
              + "app.kubernetes.io/name"      = "cert-manager"
            }
          + name             = "cert-manager"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.dns-account will be created
  + resource "kubernetes_service_account" "dns-account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "eks.amazonaws.com/role-arn"               = "arn:aws:iam::353591665476:role/external-dns"
              + "eks.amazonaws.com/sts-regional-endpoints" = "true"
            }
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/component" = "external-dns"
              + "app.kubernetes.io/name"      = "external-dns"
            }
          + name             = "external-dns"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @eevlogiev, Action: `pull_request`*